org/prj/electra.org
#+STARTUP: showall indent hidestars
#+HTML_HEAD: <!-- -*- mode: org; fill-column: 87 -*-  -->

#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="/css/style.css" rel="stylesheet" type="text/css" />

#+OPTIONS: toc:nil num:nil h:4 html-postamble:nil html-preamble:t tex:t f:t

#+TOC: headlines 3

#+HTML: <div class="outline-2" id="meta"><a href="/">На главную</a></div>

#+TITLE: Моделирование электронных схем

* Интро

Распространение сигнала внутри схемы дает возможность иначе
взглянуть на процесс программирования и отладки и применить очень
необычные и мощные идеи.

Я написал язык предметной области (DSL) для построения схем и
виртуальную машину в которой он исполняется, чтобы получать
результаты распространения сигнала в моделируемой схеме.

Однако этого оказалось недостаточно для обеспечения наглядности,
поэтому я изучил Tcl/Tk и запрограммировал визуализатор
распространения сигнала, чтобы прямо на экране видеть, как высокие и
низкие уровни двигаются от одного элемента к другому.
