www/prj/electra.html
<!DOCTYPE html>
<html>
<head>
<title>Моделирование электронных схем</title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Моделирование электронных схем</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Интро</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Интро</a></li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Интро</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Распространение сигнала внутри схемы дает возможность иначе взглянуть на процесс
программирования и отладки и применить очень необычные и мощные идеи.
</p>

<p>
Я написал язык предметной области (DSL) для построения схем и виртуальную машину в
которой он исполняется, чтобы получать результаты распространения сигнала в
моделируемой схеме.
</p>

<p>
Однако этого оказалось недостаточно для обеспечения наглядности, поэтому я изучил
Tcl/Tk и запрограммировал визуализатор распространения сигнала, чтобы прямо на экране
видеть, как высокие и низкие уровни двигаются от одного элемента к другому.
</p>
</div>
</div>
</div>
</body>
</html>
